w12/w12d2/benchBNB/app/controllers/application_controller.rb

  def current_user
    # Check for session_token
    # return nil unless session[:session_token]
    if session[:session_token]
        @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "i86J9LEp0wM-gnHjZC4GpA"], ["LIMIT", 1]]