w7/w7d5/reddit_clone/app/models/user.rb

    def self.find_by_credentials(password, username)
        @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "444444"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::base64(64)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KJK+ZpguWG8YEHxFJWtmtcHJdUcivN9uNJ5mqwspM0Oo5BPrpEfcWxEBqbIAcCFnnBmp9iEDzz5nNNnzmv3SYw=="], ["updated_at", "2021-10-15 23:29:35.530205"], ["id", 3]]