w6/w6d3/art_share_api/app/controllers/artwork_shares_controller.rb

  def create
    # debugger
    artwork_share = ArtworkShare.new(artwork_share_params)
    if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2], ["created_at", "2021-10-07 23:45:16.555685"], ["updated_at", "2021-10-07 23:45:16.555685"]]