w6/w6d3/art_share_api/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The last supper"], ["image_url", "url6"], ["artist_id", 1], ["created_at", "2021-10-07 23:11:13.004107"], ["updated_at", "2021-10-07 23:11:13.004107"]]
---
  def create
    # debugger
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 3], ["updated_at", "2021-10-07 23:12:55.392046"], ["id", 6]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)