w6/w6d3/art_share_api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "ted"], ["created_at", "2021-10-07 22:40:37.448116"], ["updated_at", "2021-10-07 22:40:37.448116"]]
---
  def create
    # debugger
    user = User.new(user_params)
    if user.save