w12/w12d2/benchBNB/app/models/user.rb

  def reset_session_token!
    # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
    self.session_token = SecureRandom.urlsafe_base64
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "leDD1ngwhaa0EoWqvWl9Vg"], ["updated_at", "2021-11-17 17:53:30.682553"], ["id", 4]]