w7/w7d2/music_app/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token]) #why not set it by email
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]