w6/w6d3/First_Routes_and_Controller/app/controllers/users_controller.rb

  def create
    # debugger
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "tim"], ["email", "tim@email.com"], ["created_at", "2021-10-07 17:51:06.005241"], ["updated_at", "2021-10-07 17:51:06.005241"]]