w7/w7d5/reddit_clone/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show #need to delete this later
    @user = User.find_by(id: params[:id])